llm/gemma4/b200/bench/bench_random_high.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='google/gemma-4-26B-A4B-it', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='/data/bbuf/kda-pilot/llm/gemma4/b200/bench/random_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/data/bbuf/kda-pilot/llm/gemma4/b200/profile/random_high', profile_prefix='random_high', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='google/gemma-4-26B-A4B-it', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='/data/bbuf/kda-pilot/llm/gemma4/b200/bench/random_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/data/bbuf/kda-pilot/llm/gemma4/b200/profile/random_high', profile_prefix='random_high', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 249831
#Output tokens: 252662
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Starting profiler...
async_request_profile api_url='http://127.0.0.1:30000/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None, 'output_dir': '/data/bbuf/kda-pilot/llm/gemma4/b200/profile/random_high/1781868830.3139396', 'profile_prefix': 'random_high'}
Profiler started

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 100       
Successful requests:                     500       
Benchmark duration (s):                  51.11     
Total input tokens:                      249831    
Total input text tokens:                 249831    
Total generated tokens:                  252662    
Total generated tokens (retokenized):    250497    
Request throughput (req/s):              9.78      
Input token throughput (tok/s):          4887.64   
Output token throughput (tok/s):         4943.02   
Peak output token throughput (tok/s):    8099.00   
Peak concurrent requests:                114       
Total token throughput (tok/s):          9830.66   
Concurrency:                             91.86     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   9390.41   
Median E2E Latency (ms):                 9157.62   
P90 E2E Latency (ms):                    17142.29  
P99 E2E Latency (ms):                    19306.94  
---------------Time to First Token----------------
Mean TTFT (ms):                          319.28    
Median TTFT (ms):                        60.52     
P99 TTFT (ms):                           1300.58   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          18.25     
Median TPOT (ms):                        18.62     
P99 TPOT (ms):                           22.68     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           17.99     
Median ITL (ms):                         12.57     
P95 ITL (ms):                            45.89     
P99 ITL (ms):                            49.97     
Max ITL (ms):                            944.66    
==================================================